Documents/EDPackage.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>EDPackage</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CounterpartyResourceAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyResourceAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.EmailAccounts</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PackageFormatVersion</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDPackageFormatVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalUID</Name>
					<Comment>Unique identifier of the object in the external system</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataEncrypted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RFBankClassifier</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Direction</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDDirections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDFSetup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Sender</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Recipient</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDFProfileSettings</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDFProfileSettings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EncryptionCertificate</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDExchangeMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDExchangeMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PackageStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDPackagesStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ElectronicDocuments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>OwnerObject</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DeleteDataEncrypted</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DeleteEncryptionCertificate</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ElectronicDocument</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.EDAttachedFiles</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/EDPackagesStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>EDPackagesStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Delivered</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToUnpacking</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Canceled</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PreparedToSending</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Unpacked</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UnpackedDocumentsNotProcessed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Unknown</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/EDExchangeMethods.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>EDExchangeMethods</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ThroughDirectory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ThroughEDFOperatorTaxcom</Name>
					<Comment>Through operator of electronic document flow TaxCom</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ThroughEMail</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ThroughBankWebSource</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ThroughFTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QuickExchange</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/BankApplications.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>BankApplications</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AlphaBankOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SberbankOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExchangeThroughTheAdditionalInformationProcessor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AsynchronousExchange</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>iBank2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/EDDirections.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>EDDirections</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Incoming</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Intercompany</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Outgoing</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/EDPackage/Forms/DocumentForm/Ext/Form/Module.bsl
#Region CommandsActionsForms

&AtClient
Procedure UnpackEDPackage(Command)
	
	ArrayPED = New Array;
	ArrayPED.Add(Object.Ref);
	ElectronicDocumentsServiceClient.UnpackEDPackagesArray(ArrayPED);
	Read();
	
EndProcedure

#EndRegion

#Region FieldsFormEventsHandlers

&AtClient
Procedure SelectionElectronicDocuments(Item, SelectedRow, Field, StandardProcessing)
	
	If Field.Name = "ElectronicDocumentsObjectOwner" Then
		ShowValue(,Item.CurrentData.OwnerObject);
		
	ElsIf TypeOf(Item.CurrentData.ElectronicDocument) = Type("CatalogRef.EDAttachedFiles") Then
		StandardProcessing = False;
		ElectronicDocumentsServiceClient.OpenEDForViewing(Item.CurrentData.ElectronicDocument);
	
	Else
		ShowValue(,Item.CurrentData.ElectronicDocument);
	EndIf;
	
EndProcedure

#EndRegion

#Region FormEventsHandlers

&AtServer
Procedure OnReadAtServer(CurrentObject)
	
	Items.CommandUnpackEDPackage.Visible = Object.PackageStatus = Enums.EDPackagesStatuses.ToUnpacking;
	Items.CounterpartyResourceAddress.Visible   = Not Object.EDExchangeMethod = Enums.EDExchangeMethods.ThroughBankWebSource;
	Items.CompanyResourceAddress.Visible   = Not Object.EDExchangeMethod = Enums.EDExchangeMethods.ThroughBankWebSource;
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Object.EDExchangeMethod = Enums.EDExchangeMethods.ThroughEDFOperatorTaxcom
		AND ValueIsFilled(Object.Sender)
		AND Not Find(Object.Sender, "2AL") > 0 Then
		
		Cancel = True;
	EndIf;
	
	AgreementAttributes = CommonUse.ObjectAttributesValues(Object.EDFSetup, "BankApplication");
	If Object.EDExchangeMethod = Enums.EDExchangeMethods.ThroughBankWebSource
		AND (AgreementAttributes.BankApplication = Enums.BankApplications.ExchangeThroughTheAdditionalInformationProcessor
			OR AgreementAttributes.BankApplication = Enums.BankApplications.iBank2) Then
		
		Items.FormDocumentEDPackageSavePackageOnDrive.Visible = False;
	EndIf;
	
	PackageStatus = Object.PackageStatus;
	FillPackageStatusesChoiceList();
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	If Not CurrentObject.PackageStatus = PackageStatus Then
		CurrentObject.PackageStatus = PackageStatus;
	EndIf;
	
	PackageStatus = Object.PackageStatus;
	FillPackageStatusesChoiceList();

EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtServer
Procedure FillPackageStatusesChoiceList()
	
	If Object.Direction = Enums.EDDirections.Incoming Then
		Items.PackageStatus.ChoiceList.LoadValues(StatusListIncoming());
	Else
		Items.PackageStatus.ChoiceList.LoadValues(StatusListOutgoing());
	EndIf;
	
EndProcedure

&AtServerNoContext
Function StatusListIncoming()
	
	StatusesArray = New Array;
	StatusesArray.Add(Enums.EDPackagesStatuses.ToUnpacking);
	StatusesArray.Add(Enums.EDPackagesStatuses.Unpacked);
	StatusesArray.Add(Enums.EDPackagesStatuses.UnpackedDocumentsNotProcessed);
	StatusesArray.Add(Enums.EDPackagesStatuses.Unknown);
	
	Return StatusesArray;
	
EndFunction

&AtServerNoContext
Function StatusListOutgoing()
	
	StatusesArray = New Array;
	StatusesArray.Add(Enums.EDPackagesStatuses.Delivered);
	StatusesArray.Add(Enums.EDPackagesStatuses.Canceled);
	StatusesArray.Add(Enums.EDPackagesStatuses.Sent);
	StatusesArray.Add(Enums.EDPackagesStatuses.PreparedToSending);
	
	Return StatusesArray;
	
EndFunction

#EndRegion
